IDEA StatiCa Open Model
InputValueType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Input value type
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum InputValueType
Public Enumeration InputValueType
public enum class InputValueType
Members
Member name | Value | Description
Calculate | 0 |  Calculate by the code
UserInput | 1 |  User input
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace